vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
// 	if(hal_boot2_get_active_entries(BOOT2_PARTITION_TYPE_FW, &ptEntry))
// 	{
// 		printf("PtTable_Get_Active_Entries fail\r\n");
// 		vPortFree(recv_buffer);
// 		bl_mtd_close(handle);
// 		return http_rest_error(request, -20, "PtTable_Get_Active_Entries fail");
// 	}
// 	ota_addr = ptEntry.Address[!ptEntry.activeIndex];
// 	bin_size = ptEntry.maxLen[!ptEntry.activeIndex];
// 	part_size = ptEntry.maxLen[!ptEntry.activeIndex];
// 	(void)part_size;
// 	/*XXX if you use bin_size is product env, you may want to set bin_size to the actual
// 	 * OTA BIN size, and also you need to splilt XIP_SFlash_Erase_With_Lock into
// 	 * serveral pieces. Partition size vs bin_size check is also needed
// 	 */
// 	printf("Starting OTA test. OTA size is %lu\r\n", bin_size);

// 	printf("[OTA] [TEST] activeIndex is %u, use OTA address=%08x\r\n", ptEntry.activeIndex, (unsigned int)ota_addr);

// 	printf("[OTA] [TEST] Erase flash with size %lu...", bin_size);
// 	hal_update_mfg_ptable();

// 	//Erase in chunks, because erasing everything at once is slow and causes issues with http connection
// 	uint32_t erase_offset = 0;
// 	uint32_t erase_len = 0;
// 	while(erase_offset < bin_size)
// 	{
// 		erase_len = bin_size - erase_offset;
// 		if(erase_len > 0x10000)
// 		{
// 			erase_len = 0x10000; //Erase in 64kb chunks
// 		}
// 		bl_mtd_erase(handle, erase_offset, erase_len);
// 		printf("[OTA] Erased:  %lu / %lu \r\n", erase_offset, erase_len);
// 		erase_offset += erase_len;
// 		rtos_delay_milliseconds(100);
// 	}
// 	printf("[OTA] Done\r\n");

// 	if(request->contentLength >= 0)
// 	{
// 		towrite = request->contentLength;
// 	}

// 	// get header
// 	// recv_buffer	
// 	//buffer_offset = 0;
// 	//do {
// 	//	int take_len;

// 	//	take_len = OTA_PROGRAM_SIZE - buffer_offset;

// 	//	memcpy(recv_buffer + buffer_offset, writebuf, writelen);
// 	//	buffer_offset += writelen;


// 	//	if (towrite > 0) {
// 	//		writebuf = request->received;
// 	//		writelen = recv(request->fd, writebuf, request->receivedLenmax, 0);
// 	//		if (writelen < 0) {
// 	//			ADDLOG_DEBUG(LOG_FEATURE_OTA, "recv returned %d - end of data - remaining %d", writelen, towrite);
// 	//		}
// 	//	}
// 	//} while(true)

// 	buffer_offset = 0;
// 	flash_offset = 0;
// 	ota_header = 0;
// 	use_xz = 0;

// 	utils_sha256_init(&ctx);
// 	utils_sha256_starts(&ctx);
// 	memset(sha256_result, 0, sizeof(sha256_result));
// 	do
// 	{
// 		char* useBuf = writebuf;
// 		int useLen = writelen;

// 		if(ota_header == 0)
// 		{
// 			int take_len;

// 			// how much left for header?
// 			take_len = OTA_PROGRAM_SIZE - buffer_offset;
// 			// clamp to available len
// 			if(take_len > useLen)
// 				take_len = useLen;
// 			printf("Header takes %i. ", take_len);
// 			memcpy(recv_buffer + buffer_offset, writebuf, take_len);
// 			buffer_offset += take_len;
// 			useBuf = writebuf + take_len;
// 			useLen = writelen - take_len;

// 			if(buffer_offset >= OTA_PROGRAM_SIZE)
// 			{
// 				ota_header = (ota_header_t*)recv_buffer;
// 				if(strncmp((const char*)ota_header, "BL60X_OTA", 9))
// 				{
// 					return http_rest_error(request, -20, "Invalid header ident");
// 				}
// 			}
// 		}


// 		if(ota_header && useLen)
// 		{
// 			if(flash_offset + useLen >= part_size)
// 			{
// 				return http_rest_error(request, -20, "Too large bin");
// 			}
// 			//ADDLOG_DEBUG(LOG_FEATURE_OTA, "%d bytes to write", writelen);
// 			//add_otadata((unsigned char*)writebuf, writelen);

// 			printf("Flash takes %i. ", useLen);
// 			utils_sha256_update(&ctx, (byte*)useBuf, useLen);
// 			bl_mtd_write(handle, flash_offset, useLen, (byte*)useBuf);
// 			flash_offset += useLen;
// 		}

// 		total += writelen;
// 		startaddr += writelen;
// 		towrite -= writelen;


// 		if(towrite > 0)
// 		{
// 			writebuf = request->received;
// 			writelen = recv(request->fd, writebuf, request->receivedLenmax, 0);
// 			if(writelen < 0)
// 			{
// 				ADDLOG_DEBUG(LOG_FEATURE_OTA, "recv returned %d - end of data - remaining %d", writelen, towrite);
// 			}
// 		}
// 	} while((towrite > 0) && (writelen >= 0));

// 	if(ota_header == 0)
// 	{
// 		return http_rest_error(request, -20, "No header found");
// 	}
// 	utils_sha256_finish(&ctx, sha256_result);
// 	puts("\r\nCalculated SHA256 Checksum:");
// 	for(i = 0; i < sizeof(sha256_result); i++)
// 	{
// 		printf("%02X", sha256_result[i]);
// 	}
// 	puts("\r\nHeader SHA256 Checksum:");
// 	for(i = 0; i < sizeof(sha256_result); i++)
// 	{
// 		printf("%02X", ota_header->u.s.sha256[i]);
// 	}
// 	if(memcmp(ota_header->u.s.sha256, sha256_result, sizeof(sha256_img)))
// 	{
// 		/*Error found*/
// 		return http_rest_error(request, -20, "SHA256 NOT Correct");
// 	}
// 	printf("[OTA] [TCP] prepare OTA partition info\r\n");
// 	ptEntry.len = total;
// 	printf("[OTA] [TCP] Update PARTITION, partition len is %lu\r\n", ptEntry.len);
// 	hal_boot2_update_ptable(&ptEntry);
// 	printf("[OTA] [TCP] Rebooting\r\n");
// 	//close_ota();
// 	vPortFree(recv_buffer);
// 	utils_sha256_free(&ctx);
// 	bl_mtd_close(handle);


// 	// ADDLOG_DEBUG(LOG_FEATURE_OTA, "%d total bytes written", total);
// 	// http_setup(request, httpMimeTypeJson);
// 	// hprintf255(request, "{\"size\":%d}", total);
// 	// poststr(request, NULL);
// 	// CFG_IncrementOTACount();
// 	return 0;
// }

err_t handle_firmware_upload(struct netconn *conn, char *request_buf, u16_t request_len) {
    // http_rest_post_flash(request, -1, -1);

    // Initialize OTA
    // int ret = ota_init("ota_update");
    // if (ret != 0) {
    //     printf("[handle_firmware_upload] OTA initialization failed: %d\n", ret);
    //     return ERR_VAL;
    // }

    // // Extract the firmware binary from the HTTP POST body
    char *body = strstr(request_buf, "\r\n\r\n");
    if (!body) {
        puts("[handle_firmware_upload] HTTP body not found\n");
        // ota_deinit();
        return ERR_VAL;
    }

    body += 4;  // Skip over "\r\n\r\n" to the start of the firmware binary
    u16_t body_len = request_len - (body - request_buf);
    printf("[handle_firmware_upload] Body length: %i\n", body_len);
    // // Write the firmware to the OTA partition
    // ret = ota_write(body, body_len);
    // if (ret != 0) {
    //     printf("[handle_firmware_upload] OTA write failed: %d\n", ret);
    //     ota_deinit();
    //     return ERR_VAL;
    // }

    // printf("[handle_firmware_upload] Firmware uploaded: %d bytes\n", body_len);

    // // Finalize OTA
    // ret = ota_finalize();
    // if (ret != 0) {
    //     printf("[handle_firmware_upload] OTA finalize failed: %d\n", ret);
    //     ota_deinit();
    //     return ERR_VAL;
    // }

