vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
//     puts("Booting BL602 Chip...\r\n");

//     /*Display Banner*/
//     if (0 == bl_chip_banner(&banner)) {
//         puts(banner);
//     }
//     puts("\r\n");
//     /*Chip Feature list*/
//     puts("\r\n");
//     puts("------------------------------------------------------------\r\n");
//     puts("RISC-V Core Feature:");
//     bl_chip_info(chip_feature);
//     puts(chip_feature);
//     puts("\r\n");

//     puts("Build Version: ");
//     puts(BL_SDK_VER); // @suppress("Symbol is not resolved")
//     puts("\r\n");

//     puts("PHY   Version: ");
//     puts(BL_SDK_PHY_VER); // @suppress("Symbol is not resolved")
//     puts("\r\n");

//     puts("RF    Version: ");
//     puts(BL_SDK_RF_VER); // @suppress("Symbol is not resolved")
//     puts("\r\n");

//     puts("Build Date: ");
//     puts(__DATE__);
//     puts("\r\n");

//     puts("Build Time: ");
//     puts(__TIME__);
//     puts("\r\n");
//     puts("------------------------------------------------------------\r\n");

// }

static void system_init(void)
{
    blog_init();
    bl_irq_init();
    bl_sec_init();
    bl_sec_test();
    bl_dma_init();
    hal_boot2_init();

    /* board config is set after system is init*/
    hal_board_cfg(0);
}

static void system_thread_init()
{
    /*nothing here*/
}

int timeout = 1000;
bool ap_started = false;


static void custom_task_func(void *pvParameters) {
    vTaskDelay(1000);
    while (1) {
        if(!ap_started && finished_init) {
            puts("Starting ap...");
            wifi_mgmr_ap_start(wifi_mgmr_ap_enable(), "Test this", 0, NULL, 1);
            ap_started = true;
            char value = 0;
            puts("=== Easyflash env ===\n");
            ef_print_env();
            puts("=====================\n");
            struct env_node_obj env_node;
            if (ef_get_env_obj("testval", &env_node)) {
                size_t readlen = ef_get_env_blob("testval", &value, sizeof(char), NULL);
                printf("Readlen: %i\n", readlen);
                printf("Current value: %i\n", value);
            } else {
                puts("Couldn't find env_obj\n");
            }
            value++;
            char value_str[2];
            value_str[0] = value;
            value_str[1] = '\0';
            ef_set_env("testval", (const char *)&value_str);
            break;
        }
        vTaskDelay(3000);
    }
    puts("Custom task end");
    vTaskDelete(NULL);

}

void bfl_main()
{
    static StackType_t aos_loop_proc_stack[1024];
    static StaticTask_t aos_loop_proc_task;
    static StackType_t proc_hellow_stack[512];
    static StaticTask_t proc_hellow_task;
    static StackType_t custom_task_stack[512];
    static StaticTask_t custom_task;
    
    time_main = bl_timer_now_us();
    /*Init UART In the first place*/
    bl_uart_init(0, 16, 7, 255, 255, 2 * 1000 * 1000);
    puts("Starting firmware now....\r\n");

    // _dump_boot_info();

    vPortDefineHeapRegions(xHeapRegions);
    printf("Heap %u@%p, %u@%p\r\n",
            (unsigned int)&_heap_size, &_heap_start,
            (unsigned int)&_heap_wifi_size, &_heap_wifi_start
    );
    printf("Boot2 consumed %lums\r\n", time_main / 1000);

    system_init();
    system_thread_init();

    puts("[OS] Added proc_hellow_entry task\r\n");
    xTaskCreateStatic(proc_hellow_entry, (char*)"hellow", 512, NULL, 15, proc_hellow_stack, &proc_hellow_task);
    puts("[OS] Added aos_loop_proc task\r\n");
    xTaskCreateStatic(aos_loop_proc, (char*)"event_loop", 1024, NULL, 15, aos_loop_proc_stack, &aos_loop_proc_task);
    puts("[OS] Starting TCP/IP Stack...\r\n");
    xTaskCreateStatic(custom_task_func, (char*)"custom_task", 512, NULL, 15, custom_task_stack, &custom_task);
    puts("[OS] Starting TCP/IP Stack...\r\n");
    tcpip_init(NULL, NULL);

    puts("[OS] Starting OS Scheduler...\r\n");
    vTaskStartScheduler();
}